testing YAML deploy via terraform

```
student_01_7d35478bb528@cloudshell:~/gke-secure-ci/terraform (qwiklabs-gcp-01-470c77136542)$ terraform init
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of gavinbunney/kubectl from the dependency lock file
- Using previously-installed hashicorp/google v3.86.0
- Using previously-installed hashicorp/kubernetes v2.5.0
- Using previously-installed gavinbunney/kubectl v1.11.3

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
student_01_7d35478bb528@cloudshell:~/gke-secure-ci/terraform (qwiklabs-gcp-01-470c77136542)$ terraform validate
Success! The configuration is valid.

student_01_7d35478bb528@cloudshell:~/gke-secure-ci/terraform (qwiklabs-gcp-01-470c77136542)$ terraform plan -out franklin.out

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tekton.kubectl_manifest.tekton-cluster-role will be created
  + resource "kubectl_manifest" "tekton-cluster-role" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "tekton-bot-clusterrole"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              name: tekton-bot-clusterrole
            rules:
            - apiGroups:
              - triggers.tekton.dev
              resources:
              - clustertriggerbindings
              - clusterinterceptors
              verbs:
              - get
              - list
              - watch
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.tekton.kubectl_manifest.tekton-cluster-role-binding will be created
  + resource "kubectl_manifest" "tekton-cluster-role-binding" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "tekton-bot-clusterbinding"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: tekton-bot-clusterbinding
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: tekton-bot-clusterrole
            subjects:
            - kind: ServiceAccount
              name: tekton-sa
              namespace: tekton-pipelines
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.tekton.kubectl_manifest.tekton-config-defaults will be created
  + resource "kubectl_manifest" "tekton-config-defaults" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConfigMap"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "config-defaults"
      + namespace               = "tekton-pipelines"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              default-managed-by-label-value: franklin-tekton
              default-pod-template: |
                nodeSelector:
                  cloud.google.com/gke-nodepool: build-pool
              default-service-account: tekton-sa
              default-task-run-workspace-binding: |
                emptyDir: {}
              default-timeout-minutes: "20"
            kind: ConfigMap
            metadata:
              labels:
                app.kubernetes.io/instance: default
                app.kubernetes.io/part-of: tekton-pipelines
              name: config-defaults
              namespace: tekton-pipelines
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.tekton.kubectl_manifest.tekton-namespace will be created
  + resource "kubectl_manifest" "tekton-namespace" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "tekton-pipelines"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: tekton-pipelines
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.tekton.kubectl_manifest.tekton-persistent-vol-claim will be created
  + resource "kubectl_manifest" "tekton-persistent-vol-claim" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PersistentVolumeClaim"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "tekton-pvc"
      + namespace               = "tekton-pipelines"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: PersistentVolumeClaim
            metadata:
              name: tekton-pvc
              namespace: tekton-pipelines
            spec:
              accessModes:
              - ReadWriteOnce
              resources:
                requests:
                  storage: 30Gi
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.tekton.kubectl_manifest.tekton-pod-security-policy will be created
  + resource "kubectl_manifest" "tekton-pod-security-policy" {
      + api_version             = "policy/v1beta1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PodSecurityPolicy"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "tekton-pipelines"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: policy/v1beta1
            kind: PodSecurityPolicy
            metadata:
              labels:
                app.kubernetes.io/instance: default
                app.kubernetes.io/part-of: tekton-pipelines
              name: tekton-pipelines
            spec:
              allowPrivilegeEscalation: false
              fsGroup:
                ranges:
                - max: 65535
                  min: 1
                rule: MustRunAs
              hostIPC: false
              hostNetwork: false
              hostPID: false
              privileged: false
              runAsUser:
                rule: MustRunAsNonRoot
              seLinux:
                rule: RunAsAny
              supplementalGroups:
                ranges:
                - max: 65535
                  min: 1
                rule: MustRunAs
              volumes:
              - emptyDir
              - configMap
              - secret
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.tekton.kubectl_manifest.tekton-role will be created
  + resource "kubectl_manifest" "tekton-role" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Role"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "tekton-bot"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: Role
            metadata:
              name: tekton-bot
            rules:
            - apiGroups:
              - triggers.tekton.dev
              resources:
              - eventlisteners
              - triggerbindings
              - triggertemplates
              - triggers
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - ""
              resources:
              - configmaps
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - tekton.dev
              resources:
              - pipelineruns
              - pipelineresources
              - taskruns
              verbs:
              - create
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              verbs:
              - impersonate
            - apiGroups:
              - policy
              resourceNames:
              - tekton-triggers
              resources:
              - podsecuritypolicies
              verbs:
              - use
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.tekton.kubectl_manifest.tekton-role-binding will be created
  + resource "kubectl_manifest" "tekton-role-binding" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "RoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "tekton-role-binding"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              name: tekton-role-binding
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: tekton-bot
            subjects:
            - kind: ServiceAccount
              name: tekton-sa
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.tekton.kubectl_manifest.tekton-service-account will be created
  + resource "kubectl_manifest" "tekton-service-account" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ServiceAccount"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "tekton-sa"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: ServiceAccount
            metadata:
              name: tekton-sa
            secrets:
            - name: github-auth
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.tekton.kubectl_manifest.tekton-storage-config-map will be created
  + resource "kubectl_manifest" "tekton-storage-config-map" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConfigMap"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "tekton-storage-configmap"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              size: 10Gi
              storageClassName: standard
            kind: ConfigMap
            metadata:
              creationTimestamp: null
              name: tekton-storage-configmap
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: franklin.out

To perform exactly these actions, run the following command to apply:
    terraform apply "franklin.out"
student_01_7d35478bb528@cloudshell:~/gke-secure-ci/terraform (qwiklabs-gcp-01-470c77136542)$ terraform apply "franklin.out"
module.tekton.kubectl_manifest.tekton-service-account: Creating...
module.tekton.kubectl_manifest.tekton-role-binding: Creating...
module.tekton.kubectl_manifest.tekton-pod-security-policy: Creating...
module.tekton.kubectl_manifest.tekton-config-defaults: Creating...
module.tekton.kubectl_manifest.tekton-role: Creating...
module.tekton.kubectl_manifest.tekton-cluster-role: Creating...
module.tekton.kubectl_manifest.tekton-cluster-role-binding: Creating...
module.tekton.kubectl_manifest.tekton-namespace: Creating...
module.tekton.kubectl_manifest.tekton-storage-config-map: Creating...
module.tekton.kubectl_manifest.tekton-role: Creation complete after 1s [id=/apis/rbac.authorization.k8s.io/v1/namespaces/default/roles/tekton-bot]
module.tekton.kubectl_manifest.tekton-config-defaults: Creation complete after 1s [id=/api/v1/namespaces/tekton-pipelines/configmaps/config-defaults]
module.tekton.kubectl_manifest.tekton-service-account: Creation complete after 1s [id=/api/v1/namespaces/default/serviceaccounts/tekton-sa]
module.tekton.kubectl_manifest.tekton-namespace: Creation complete after 1s [id=/api/v1/namespaces/tekton-pipelines]
module.tekton.kubectl_manifest.tekton-role-binding: Creation complete after 1s [id=/apis/rbac.authorization.k8s.io/v1/namespaces/default/rolebindings/tekton-role-binding]
module.tekton.kubectl_manifest.tekton-persistent-vol-claim: Creating...
module.tekton.kubectl_manifest.tekton-pod-security-policy: Creation complete after 1s [id=/apis/policy/v1beta1/podsecuritypolicys/tekton-pipelines]
module.tekton.kubectl_manifest.tekton-cluster-role-binding: Creation complete after 1s [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/tekton-bot-clusterbinding]
module.tekton.kubectl_manifest.tekton-cluster-role: Creation complete after 1s [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/tekton-bot-clusterrole]
module.tekton.kubectl_manifest.tekton-storage-config-map: Creation complete after 1s [id=/api/v1/namespaces/default/configmaps/tekton-storage-configmap]
module.tekton.kubectl_manifest.tekton-persistent-vol-claim: Creation complete after 0s [id=/api/v1/namespaces/tekton-pipelines/persistentvolumeclaims/tekton-pvc]

Apply complete! Resources: 10 added, 0 changed, 0 destroyed.
student_01_7d35478bb528@cloudshell:~/gke-secure-ci/terraform (qwiklabs-gcp-01-470c77136542)$
```